-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-07-23 06:40:46
-- 伺服器版本： 10.4.22-MariaDB
-- PHP 版本： 7.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `ichiban`
--

-- --------------------------------------------------------

--
-- 資料表結構 `cities`
--

CREATE TABLE `cities` (
  `id` int(11) NOT NULL,
  `city` varchar(20) NOT NULL,
  `update_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='台灣城市資料';

--
-- 傾印資料表的資料 `cities`
--

INSERT INTO `cities` (`id`, `city`, `update_date`) VALUES
(1, '台北市', '2023-03-22 15:10:09'),
(2, '新北市', '2023-03-22 15:10:09'),
(3, '基隆市', '2023-03-22 15:10:09'),
(4, '桃園市', '2023-03-22 15:10:09'),
(5, '新竹市', '2023-03-22 15:10:09'),
(6, '新竹縣', '2023-03-22 15:10:09'),
(7, '苗栗縣', '2023-03-22 15:10:09'),
(8, '台中市', '2023-03-22 15:10:09'),
(9, '彰化縣', '2023-03-22 15:10:09'),
(10, '南投縣', '2023-03-22 15:10:09'),
(11, '雲林縣', '2023-03-22 15:10:09'),
(12, '嘉義市', '2023-03-22 15:10:09'),
(13, '嘉義縣', '2023-03-22 15:10:09'),
(14, '台南市', '2023-03-22 15:10:09'),
(15, '高雄市', '2023-03-22 15:10:09'),
(16, '屏東縣', '2023-03-22 15:10:09'),
(17, '台東縣', '2023-03-22 15:10:09'),
(18, '花蓮縣', '2023-03-22 15:10:09'),
(19, '宜蘭縣', '2023-03-22 15:10:10'),
(20, '澎湖縣', '2023-03-22 15:10:10'),
(21, '金門縣', '2023-03-22 15:10:10'),
(22, '連江縣', '2023-03-22 15:10:10');

-- --------------------------------------------------------

--
-- 資料表結構 `cooperative_stores`
--

CREATE TABLE `cooperative_stores` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `category_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '分類',
  `name` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '店家名',
  `logo` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'LOGO',
  `summary` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '摘要',
  `content` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '內文',
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '電話',
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'Email',
  `address` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '地址',
  `website` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '官網',
  `fb` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '臉書',
  `line` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'LINE',
  `ig` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'IG',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '是否開啟',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `cooperative_stores`
--

INSERT INTO `cooperative_stores` (`id`, `sort`, `category_id`, `name`, `logo`, `summary`, `content`, `phone`, `email`, `address`, `website`, `fb`, `line`, `ig`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 0, 0, '丸丸模型屋', 'test', 'test', 'test', '0928123456', '123@gmail.com', '台北市中山區100號', 'https://google.com', 'https://google.com', 'https://google.com', 'https://google.com', 'on', '2024-07-22 10:56:26', '2024-07-22 11:34:05', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `dists`
--

CREATE TABLE `dists` (
  `id` int(11) NOT NULL,
  `city_id` int(11) NOT NULL,
  `city` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `dist` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `zipcode` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `update_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='台灣鄉鎮市區資料';

--
-- 傾印資料表的資料 `dists`
--

INSERT INTO `dists` (`id`, `city_id`, `city`, `dist`, `zipcode`, `update_date`) VALUES
(1, 1, '台北市', '中正區', '100', '2023-03-22 15:10:09'),
(2, 1, '台北市', '大同區', '103', '2023-03-22 15:10:09'),
(3, 1, '台北市', '中山區', '104', '2023-03-22 15:10:09'),
(4, 1, '台北市', '松山區', '105', '2023-03-22 15:10:09'),
(5, 1, '台北市', '大安區', '106', '2023-03-22 15:10:09'),
(6, 1, '台北市', '萬華區', '108', '2023-03-22 15:10:09'),
(7, 1, '台北市', '信義區', '110', '2023-03-22 15:10:09'),
(8, 1, '台北市', '士林區', '111', '2023-03-22 15:10:09'),
(9, 1, '台北市', '北投區', '112', '2023-03-22 15:10:09'),
(10, 1, '台北市', '內湖區', '114', '2023-03-22 15:10:09'),
(11, 1, '台北市', '南港區', '115', '2023-03-22 15:10:09'),
(12, 1, '台北市', '文山區', '116', '2023-03-22 15:10:09'),
(13, 2, '新北市', '萬里區', '207', '2023-03-22 15:10:09'),
(14, 2, '新北市', '金山區', '208', '2023-03-22 15:10:09'),
(15, 2, '新北市', '板橋區', '220', '2023-03-22 15:10:09'),
(16, 2, '新北市', '汐止區', '221', '2023-03-22 15:10:09'),
(17, 2, '新北市', '深坑區', '222', '2023-03-22 15:10:09'),
(18, 2, '新北市', '石碇區', '223', '2023-03-22 15:10:09'),
(19, 2, '新北市', '瑞芳區', '224', '2023-03-22 15:10:09'),
(20, 2, '新北市', '平溪區', '226', '2023-03-22 15:10:09'),
(21, 2, '新北市', '雙溪區', '227', '2023-03-22 15:10:09'),
(22, 2, '新北市', '貢寮區', '228', '2023-03-22 15:10:09'),
(23, 2, '新北市', '新店區', '231', '2023-03-22 15:10:09'),
(24, 2, '新北市', '坪林區', '232', '2023-03-22 15:10:09'),
(25, 2, '新北市', '烏來區', '233', '2023-03-22 15:10:09'),
(26, 2, '新北市', '永和區', '234', '2023-03-22 15:10:09'),
(27, 2, '新北市', '中和區', '235', '2023-03-22 15:10:09'),
(28, 2, '新北市', '土城區', '236', '2023-03-22 15:10:09'),
(29, 2, '新北市', '三峽區', '237', '2023-03-22 15:10:09'),
(30, 2, '新北市', '樹林區', '238', '2023-03-22 15:10:09'),
(31, 2, '新北市', '鶯歌區', '239', '2023-03-22 15:10:09'),
(32, 2, '新北市', '三重區', '241', '2023-03-22 15:10:09'),
(33, 2, '新北市', '新莊區', '242', '2023-03-22 15:10:09'),
(34, 2, '新北市', '泰山區', '243', '2023-03-22 15:10:09'),
(35, 2, '新北市', '林口區', '244', '2023-03-22 15:10:09'),
(36, 2, '新北市', '蘆洲區', '247', '2023-03-22 15:10:09'),
(37, 2, '新北市', '五股區', '248', '2023-03-22 15:10:09'),
(38, 2, '新北市', '八里區', '249', '2023-03-22 15:10:09'),
(39, 2, '新北市', '淡水區', '251', '2023-03-22 15:10:09'),
(40, 2, '新北市', '三芝區', '252', '2023-03-22 15:10:09'),
(41, 2, '新北市', '石門區', '253', '2023-03-22 15:10:09'),
(42, 3, '基隆市', '仁愛區', '200', '2023-03-22 15:10:09'),
(43, 3, '基隆市', '信義區', '201', '2023-03-22 15:10:09'),
(44, 3, '基隆市', '中正區', '202', '2023-03-22 15:10:09'),
(45, 3, '基隆市', '中山區', '203', '2023-03-22 15:10:09'),
(46, 3, '基隆市', '安樂區', '204', '2023-03-22 15:10:09'),
(47, 3, '基隆市', '暖暖區', '205', '2023-03-22 15:10:09'),
(48, 3, '基隆市', '七堵區', '206', '2023-03-22 15:10:09'),
(49, 4, '桃園市', '中壢區', '320', '2023-03-22 15:10:09'),
(50, 4, '桃園市', '平鎮區', '324', '2023-03-22 15:10:09'),
(51, 4, '桃園市', '龍潭區', '325', '2023-03-22 15:10:09'),
(52, 4, '桃園市', '楊梅區', '326', '2023-03-22 15:10:09'),
(53, 4, '桃園市', '新屋區', '327', '2023-03-22 15:10:09'),
(54, 4, '桃園市', '觀音區', '328', '2023-03-22 15:10:09'),
(55, 4, '桃園市', '桃園區', '330', '2023-03-22 15:10:09'),
(56, 4, '桃園市', '龜山區', '333', '2023-03-22 15:10:09'),
(57, 4, '桃園市', '八德區', '334', '2023-03-22 15:10:09'),
(58, 4, '桃園市', '大溪區', '335', '2023-03-22 15:10:09'),
(59, 4, '桃園市', '復興區', '336', '2023-03-22 15:10:09'),
(60, 4, '桃園市', '大園區', '337', '2023-03-22 15:10:09'),
(61, 4, '桃園市', '蘆竹區', '338', '2023-03-22 15:10:09'),
(62, 5, '新竹市', '新竹市', '300', '2023-03-22 15:10:09'),
(63, 6, '新竹縣', '竹北市', '302', '2023-03-22 15:10:09'),
(64, 6, '新竹縣', '湖口鄉', '303', '2023-03-22 15:10:09'),
(65, 6, '新竹縣', '新豐鄉', '304', '2023-03-22 15:10:09'),
(66, 6, '新竹縣', '新埔鎮', '305', '2023-03-22 15:10:09'),
(67, 6, '新竹縣', '關西鎮', '306', '2023-03-22 15:10:09'),
(68, 6, '新竹縣', '芎林鄉', '307', '2023-03-22 15:10:09'),
(69, 6, '新竹縣', '寶山鄉', '308', '2023-03-22 15:10:09'),
(70, 6, '新竹縣', '竹東鎮', '310', '2023-03-22 15:10:09'),
(71, 6, '新竹縣', '五峰鄉', '311', '2023-03-22 15:10:09'),
(72, 6, '新竹縣', '橫山鄉', '312', '2023-03-22 15:10:09'),
(73, 6, '新竹縣', '尖石鄉', '313', '2023-03-22 15:10:09'),
(74, 6, '新竹縣', '北埔鄉', '314', '2023-03-22 15:10:09'),
(75, 6, '新竹縣', '峨眉鄉', '315', '2023-03-22 15:10:09'),
(76, 7, '苗栗縣', '竹南鎮', '350', '2023-03-22 15:10:09'),
(77, 7, '苗栗縣', '頭份市', '351', '2023-03-22 15:10:09'),
(78, 7, '苗栗縣', '三灣鄉', '352', '2023-03-22 15:10:09'),
(79, 7, '苗栗縣', '南庄鄉', '353', '2023-03-22 15:10:09'),
(80, 7, '苗栗縣', '獅潭鄉', '354', '2023-03-22 15:10:09'),
(81, 7, '苗栗縣', '後龍鎮', '356', '2023-03-22 15:10:09'),
(82, 7, '苗栗縣', '通霄鎮', '357', '2023-03-22 15:10:09'),
(83, 7, '苗栗縣', '苑裡鎮', '358', '2023-03-22 15:10:09'),
(84, 7, '苗栗縣', '苗栗市', '360', '2023-03-22 15:10:09'),
(85, 7, '苗栗縣', '造橋鄉', '361', '2023-03-22 15:10:09'),
(86, 7, '苗栗縣', '頭屋鄉', '362', '2023-03-22 15:10:09'),
(87, 7, '苗栗縣', '公館鄉', '363', '2023-03-22 15:10:09'),
(88, 7, '苗栗縣', '大湖鄉', '364', '2023-03-22 15:10:09'),
(89, 7, '苗栗縣', '泰安鄉', '365', '2023-03-22 15:10:09'),
(90, 7, '苗栗縣', '銅鑼鄉', '366', '2023-03-22 15:10:09'),
(91, 7, '苗栗縣', '三義鄉', '367', '2023-03-22 15:10:09'),
(92, 7, '苗栗縣', '西湖鄉', '368', '2023-03-22 15:10:09'),
(93, 7, '苗栗縣', '卓蘭鎮', '369', '2023-03-22 15:10:09'),
(94, 8, '台中市', '中區', '400', '2023-03-22 15:10:09'),
(95, 8, '台中市', '東區', '401', '2023-03-22 15:10:09'),
(96, 8, '台中市', '南區', '402', '2023-03-22 15:10:09'),
(97, 8, '台中市', '西區', '403', '2023-03-22 15:10:09'),
(98, 8, '台中市', '北區', '404', '2023-03-22 15:10:09'),
(99, 8, '台中市', '北屯區', '406', '2023-03-22 15:10:09'),
(100, 8, '台中市', '西屯區', '407', '2023-03-22 15:10:09'),
(101, 8, '台中市', '南屯區', '408', '2023-03-22 15:10:09'),
(102, 8, '台中市', '太平區', '411', '2023-03-22 15:10:09'),
(103, 8, '台中市', '大里區', '412', '2023-03-22 15:10:09'),
(104, 8, '台中市', '霧峰區', '413', '2023-03-22 15:10:09'),
(105, 8, '台中市', '烏日區', '414', '2023-03-22 15:10:09'),
(106, 8, '台中市', '豐原區', '420', '2023-03-22 15:10:09'),
(107, 8, '台中市', '后里區', '421', '2023-03-22 15:10:09'),
(108, 8, '台中市', '石岡區', '422', '2023-03-22 15:10:09'),
(109, 8, '台中市', '東勢區', '423', '2023-03-22 15:10:09'),
(110, 8, '台中市', '和平區', '424', '2023-03-22 15:10:09'),
(111, 8, '台中市', '新社區', '426', '2023-03-22 15:10:09'),
(112, 8, '台中市', '潭子區', '427', '2023-03-22 15:10:09'),
(113, 8, '台中市', '大雅區', '428', '2023-03-22 15:10:09'),
(114, 8, '台中市', '神岡區', '429', '2023-03-22 15:10:09'),
(115, 8, '台中市', '大肚區', '432', '2023-03-22 15:10:09'),
(116, 8, '台中市', '沙鹿區', '433', '2023-03-22 15:10:09'),
(117, 8, '台中市', '龍井區', '434', '2023-03-22 15:10:09'),
(118, 8, '台中市', '梧棲區', '435', '2023-03-22 15:10:09'),
(119, 8, '台中市', '清水區', '436', '2023-03-22 15:10:09'),
(120, 8, '台中市', '大甲區', '437', '2023-03-22 15:10:09'),
(121, 8, '台中市', '外埔區', '438', '2023-03-22 15:10:09'),
(122, 8, '台中市', '大安區', '439', '2023-03-22 15:10:09'),
(123, 9, '彰化縣', '彰化市', '500', '2023-03-22 15:10:09'),
(124, 9, '彰化縣', '芬園鄉', '502', '2023-03-22 15:10:09'),
(125, 9, '彰化縣', '花壇鄉', '503', '2023-03-22 15:10:09'),
(126, 9, '彰化縣', '秀水鄉', '504', '2023-03-22 15:10:09'),
(127, 9, '彰化縣', '鹿港鎮', '505', '2023-03-22 15:10:09'),
(128, 9, '彰化縣', '福興鄉', '506', '2023-03-22 15:10:09'),
(129, 9, '彰化縣', '線西鄉', '507', '2023-03-22 15:10:09'),
(130, 9, '彰化縣', '和美鎮', '508', '2023-03-22 15:10:09'),
(131, 9, '彰化縣', '伸港鄉', '509', '2023-03-22 15:10:09'),
(132, 9, '彰化縣', '員林鎮', '510', '2023-03-22 15:10:09'),
(133, 9, '彰化縣', '社頭鄉', '511', '2023-03-22 15:10:09'),
(134, 9, '彰化縣', '永靖鄉', '512', '2023-03-22 15:10:09'),
(135, 9, '彰化縣', '埔心鄉', '513', '2023-03-22 15:10:09'),
(136, 9, '彰化縣', '溪湖鎮', '514', '2023-03-22 15:10:09'),
(137, 9, '彰化縣', '大村鄉', '515', '2023-03-22 15:10:09'),
(138, 9, '彰化縣', '埔鹽鄉', '516', '2023-03-22 15:10:09'),
(139, 9, '彰化縣', '田中鎮', '520', '2023-03-22 15:10:09'),
(140, 9, '彰化縣', '北斗鎮', '521', '2023-03-22 15:10:09'),
(141, 9, '彰化縣', '田尾鄉', '522', '2023-03-22 15:10:09'),
(142, 9, '彰化縣', '埤頭鄉', '523', '2023-03-22 15:10:09'),
(143, 9, '彰化縣', '溪州鄉', '524', '2023-03-22 15:10:09'),
(144, 9, '彰化縣', '竹塘鄉', '525', '2023-03-22 15:10:09'),
(145, 9, '彰化縣', '二林鎮', '526', '2023-03-22 15:10:09'),
(146, 9, '彰化縣', '大城鄉', '527', '2023-03-22 15:10:09'),
(147, 9, '彰化縣', '芳苑鄉', '528', '2023-03-22 15:10:09'),
(148, 9, '彰化縣', '二水鄉', '530', '2023-03-22 15:10:09'),
(149, 10, '南投縣', '南投市', '540', '2023-03-22 15:10:09'),
(150, 10, '南投縣', '中寮鄉', '541', '2023-03-22 15:10:09'),
(151, 10, '南投縣', '草屯鎮', '542', '2023-03-22 15:10:09'),
(152, 10, '南投縣', '國姓鄉', '544', '2023-03-22 15:10:09'),
(153, 10, '南投縣', '埔里鎮', '545', '2023-03-22 15:10:09'),
(154, 10, '南投縣', '仁愛鄉', '546', '2023-03-22 15:10:09'),
(155, 10, '南投縣', '名間鄉', '551', '2023-03-22 15:10:09'),
(156, 10, '南投縣', '集集鎮', '552', '2023-03-22 15:10:09'),
(157, 10, '南投縣', '水里鄉', '553', '2023-03-22 15:10:09'),
(158, 10, '南投縣', '魚池鄉', '555', '2023-03-22 15:10:09'),
(159, 10, '南投縣', '信義鄉', '556', '2023-03-22 15:10:09'),
(160, 10, '南投縣', '竹山鎮', '557', '2023-03-22 15:10:09'),
(161, 10, '南投縣', '鹿谷鄉', '558', '2023-03-22 15:10:09'),
(162, 11, '雲林縣', '斗南鎮', '630', '2023-03-22 15:10:09'),
(163, 11, '雲林縣', '大埤鄉', '631', '2023-03-22 15:10:09'),
(164, 11, '雲林縣', '虎尾鎮', '632', '2023-03-22 15:10:09'),
(165, 11, '雲林縣', '土庫鎮', '633', '2023-03-22 15:10:09'),
(166, 11, '雲林縣', '褒忠鄉', '634', '2023-03-22 15:10:09'),
(167, 11, '雲林縣', '東勢鄉', '635', '2023-03-22 15:10:09'),
(168, 11, '雲林縣', '台西鄉', '636', '2023-03-22 15:10:09'),
(169, 11, '雲林縣', '崙背鄉', '637', '2023-03-22 15:10:09'),
(170, 11, '雲林縣', '麥寮鄉', '638', '2023-03-22 15:10:09'),
(171, 11, '雲林縣', '斗六市', '640', '2023-03-22 15:10:09'),
(172, 11, '雲林縣', '林內鄉', '643', '2023-03-22 15:10:09'),
(173, 11, '雲林縣', '古坑鄉', '646', '2023-03-22 15:10:09'),
(174, 11, '雲林縣', '莿桐鄉', '647', '2023-03-22 15:10:09'),
(175, 11, '雲林縣', '西螺鎮', '648', '2023-03-22 15:10:09'),
(176, 11, '雲林縣', '二崙鄉', '649', '2023-03-22 15:10:09'),
(177, 11, '雲林縣', '北港鎮', '651', '2023-03-22 15:10:09'),
(178, 11, '雲林縣', '水林鄉', '652', '2023-03-22 15:10:09'),
(179, 11, '雲林縣', '口湖鄉', '653', '2023-03-22 15:10:09'),
(180, 11, '雲林縣', '四湖鄉', '654', '2023-03-22 15:10:09'),
(181, 11, '雲林縣', '元長鄉', '655', '2023-03-22 15:10:09'),
(182, 12, '嘉義市', '嘉義市', '600', '2023-03-22 15:10:09'),
(183, 13, '嘉義縣', '番路鄉', '602', '2023-03-22 15:10:09'),
(184, 13, '嘉義縣', '梅山鄉', '603', '2023-03-22 15:10:09'),
(185, 13, '嘉義縣', '竹崎鄉', '604', '2023-03-22 15:10:09'),
(186, 13, '嘉義縣', '阿里山', '605', '2023-03-22 15:10:09'),
(187, 13, '嘉義縣', '中埔鄉', '606', '2023-03-22 15:10:09'),
(188, 13, '嘉義縣', '大埔鄉', '607', '2023-03-22 15:10:09'),
(189, 13, '嘉義縣', '水上鄉', '608', '2023-03-22 15:10:09'),
(190, 13, '嘉義縣', '鹿草鄉', '611', '2023-03-22 15:10:09'),
(191, 13, '嘉義縣', '太保鄉', '612', '2023-03-22 15:10:09'),
(192, 13, '嘉義縣', '朴子市', '613', '2023-03-22 15:10:09'),
(193, 13, '嘉義縣', '東石鄉', '614', '2023-03-22 15:10:09'),
(194, 13, '嘉義縣', '六腳鄉', '615', '2023-03-22 15:10:09'),
(195, 13, '嘉義縣', '新港鄉', '616', '2023-03-22 15:10:09'),
(196, 13, '嘉義縣', '民雄鄉', '621', '2023-03-22 15:10:09'),
(197, 13, '嘉義縣', '大林鎮', '622', '2023-03-22 15:10:09'),
(198, 13, '嘉義縣', '溪口鄉', '623', '2023-03-22 15:10:09'),
(199, 13, '嘉義縣', '義竹鄉', '624', '2023-03-22 15:10:09'),
(200, 13, '嘉義縣', '布袋鄉', '625', '2023-03-22 15:10:09'),
(201, 14, '台南市', '中西區', '700', '2023-03-22 15:10:09'),
(202, 14, '台南市', '東區', '701', '2023-03-22 15:10:09'),
(203, 14, '台南市', '南區', '702', '2023-03-22 15:10:09'),
(204, 14, '台南市', '北區', '704', '2023-03-22 15:10:09'),
(205, 14, '台南市', '安平區', '708', '2023-03-22 15:10:09'),
(206, 14, '台南市', '安南區', '709', '2023-03-22 15:10:09'),
(207, 14, '台南市', '永康區', '710', '2023-03-22 15:10:09'),
(208, 14, '台南市', '歸仁區', '711', '2023-03-22 15:10:09'),
(209, 14, '台南市', '新化區', '712', '2023-03-22 15:10:09'),
(210, 14, '台南市', '左鎮區', '713', '2023-03-22 15:10:09'),
(211, 14, '台南市', '玉井區', '714', '2023-03-22 15:10:09'),
(212, 14, '台南市', '楠西區', '715', '2023-03-22 15:10:09'),
(213, 14, '台南市', '南化區', '716', '2023-03-22 15:10:09'),
(214, 14, '台南市', '仁德區', '717', '2023-03-22 15:10:09'),
(215, 14, '台南市', '關廟區', '718', '2023-03-22 15:10:09'),
(216, 14, '台南市', '龍崎區', '719', '2023-03-22 15:10:09'),
(217, 14, '台南市', '官田區', '720', '2023-03-22 15:10:09'),
(218, 14, '台南市', '麻豆區', '721', '2023-03-22 15:10:09'),
(219, 14, '台南市', '佳里區', '722', '2023-03-22 15:10:09'),
(220, 14, '台南市', '西港區', '723', '2023-03-22 15:10:09'),
(221, 14, '台南市', '七股區', '724', '2023-03-22 15:10:09'),
(222, 14, '台南市', '將軍區', '725', '2023-03-22 15:10:09'),
(223, 14, '台南市', '學甲區', '726', '2023-03-22 15:10:09'),
(224, 14, '台南市', '北門區', '727', '2023-03-22 15:10:09'),
(225, 14, '台南市', '新營區', '730', '2023-03-22 15:10:09'),
(226, 14, '台南市', '後壁區', '731', '2023-03-22 15:10:09'),
(227, 14, '台南市', '白河區', '732', '2023-03-22 15:10:09'),
(228, 14, '台南市', '東山區', '733', '2023-03-22 15:10:09'),
(229, 14, '台南市', '六甲區', '734', '2023-03-22 15:10:09'),
(230, 14, '台南市', '下營區', '735', '2023-03-22 15:10:09'),
(231, 14, '台南市', '柳營區', '736', '2023-03-22 15:10:09'),
(232, 14, '台南市', '鹽水區', '737', '2023-03-22 15:10:09'),
(233, 14, '台南市', '善化區', '741', '2023-03-22 15:10:09'),
(234, 14, '台南市', '大內區', '742', '2023-03-22 15:10:09'),
(235, 14, '台南市', '山上區', '743', '2023-03-22 15:10:09'),
(236, 14, '台南市', '新市區', '744', '2023-03-22 15:10:09'),
(237, 14, '台南市', '安定區', '745', '2023-03-22 15:10:09'),
(238, 15, '高雄市', '新興區', '800', '2023-03-22 15:10:09'),
(239, 15, '高雄市', '前金區', '801', '2023-03-22 15:10:09'),
(240, 15, '高雄市', '苓雅區', '802', '2023-03-22 15:10:09'),
(241, 15, '高雄市', '鹽埕區', '803', '2023-03-22 15:10:09'),
(242, 15, '高雄市', '鼓山區', '804', '2023-03-22 15:10:09'),
(243, 15, '高雄市', '旗津區', '805', '2023-03-22 15:10:09'),
(244, 15, '高雄市', '前鎮區', '806', '2023-03-22 15:10:09'),
(245, 15, '高雄市', '三民區', '807', '2023-03-22 15:10:09'),
(246, 15, '高雄市', '楠梓區', '811', '2023-03-22 15:10:09'),
(247, 15, '高雄市', '小港區', '812', '2023-03-22 15:10:09'),
(248, 15, '高雄市', '左營區', '813', '2023-03-22 15:10:09'),
(249, 15, '高雄市', '仁武區', '814', '2023-03-22 15:10:09'),
(250, 15, '高雄市', '大社區', '815', '2023-03-22 15:10:09'),
(251, 15, '高雄市', '岡山區', '820', '2023-03-22 15:10:09'),
(252, 15, '高雄市', '路竹區', '821', '2023-03-22 15:10:09'),
(253, 15, '高雄市', '阿蓮區', '822', '2023-03-22 15:10:09'),
(254, 15, '高雄市', '田寮區', '823', '2023-03-22 15:10:09'),
(255, 15, '高雄市', '燕巢區', '824', '2023-03-22 15:10:09'),
(256, 15, '高雄市', '橋頭區', '825', '2023-03-22 15:10:09'),
(257, 15, '高雄市', '梓官區', '826', '2023-03-22 15:10:09'),
(258, 15, '高雄市', '彌陀區', '827', '2023-03-22 15:10:09'),
(259, 15, '高雄市', '永安區', '828', '2023-03-22 15:10:09'),
(260, 15, '高雄市', '湖內區', '829', '2023-03-22 15:10:09'),
(261, 15, '高雄市', '鳳山區', '830', '2023-03-22 15:10:09'),
(262, 15, '高雄市', '大寮區', '831', '2023-03-22 15:10:09'),
(263, 15, '高雄市', '林園區', '832', '2023-03-22 15:10:09'),
(264, 15, '高雄市', '鳥松區', '833', '2023-03-22 15:10:09'),
(265, 15, '高雄市', '大樹區', '840', '2023-03-22 15:10:09'),
(266, 15, '高雄市', '旗山區', '842', '2023-03-22 15:10:09'),
(267, 15, '高雄市', '美濃區', '843', '2023-03-22 15:10:09'),
(268, 15, '高雄市', '六龜區', '844', '2023-03-22 15:10:09'),
(269, 15, '高雄市', '內門區', '845', '2023-03-22 15:10:09'),
(270, 15, '高雄市', '杉林區', '846', '2023-03-22 15:10:09'),
(271, 15, '高雄市', '甲仙區', '847', '2023-03-22 15:10:09'),
(272, 15, '高雄市', '桃源區', '848', '2023-03-22 15:10:09'),
(273, 15, '高雄市', '那瑪夏區', '849', '2023-03-22 15:10:09'),
(274, 15, '高雄市', '茂林區', '851', '2023-03-22 15:10:09'),
(275, 15, '高雄市', '茄萣區', '852', '2023-03-22 15:10:09'),
(276, 15, '高雄市', '東沙', '817', '2023-03-22 15:10:09'),
(277, 15, '高雄市', '南沙', '819', '2023-03-22 15:10:09'),
(278, 16, '屏東縣', '屏東市', '900', '2023-03-22 15:10:09'),
(279, 16, '屏東縣', '三地鄉', '901', '2023-03-22 15:10:09'),
(280, 16, '屏東縣', '霧台鄉', '902', '2023-03-22 15:10:09'),
(281, 16, '屏東縣', '瑪家鄉', '903', '2023-03-22 15:10:09'),
(282, 16, '屏東縣', '九如鄉', '904', '2023-03-22 15:10:09'),
(283, 16, '屏東縣', '里港鄉', '905', '2023-03-22 15:10:09'),
(284, 16, '屏東縣', '高樹鄉', '906', '2023-03-22 15:10:09'),
(285, 16, '屏東縣', '鹽埔鄉', '907', '2023-03-22 15:10:09'),
(286, 16, '屏東縣', '長治鄉', '908', '2023-03-22 15:10:09'),
(287, 16, '屏東縣', '麟洛鄉', '909', '2023-03-22 15:10:09'),
(288, 16, '屏東縣', '竹田鄉', '911', '2023-03-22 15:10:09'),
(289, 16, '屏東縣', '內埔鄉', '912', '2023-03-22 15:10:09'),
(290, 16, '屏東縣', '萬丹鄉', '913', '2023-03-22 15:10:09'),
(291, 16, '屏東縣', '潮州鎮', '920', '2023-03-22 15:10:09'),
(292, 16, '屏東縣', '泰武鄉', '921', '2023-03-22 15:10:09'),
(293, 16, '屏東縣', '來義鄉', '922', '2023-03-22 15:10:09'),
(294, 16, '屏東縣', '萬巒鄉', '923', '2023-03-22 15:10:09'),
(295, 16, '屏東縣', '崁頂鄉', '924', '2023-03-22 15:10:09'),
(296, 16, '屏東縣', '新埤鄉', '925', '2023-03-22 15:10:09'),
(297, 16, '屏東縣', '南州鄉', '926', '2023-03-22 15:10:09'),
(298, 16, '屏東縣', '林邊鄉', '927', '2023-03-22 15:10:09'),
(299, 16, '屏東縣', '東港鄉', '928', '2023-03-22 15:10:09'),
(300, 16, '屏東縣', '琉球鄉', '929', '2023-03-22 15:10:09'),
(301, 16, '屏東縣', '佳冬鄉', '931', '2023-03-22 15:10:09'),
(302, 16, '屏東縣', '新園鄉', '932', '2023-03-22 15:10:09'),
(303, 16, '屏東縣', '枋寮鄉', '940', '2023-03-22 15:10:09'),
(304, 16, '屏東縣', '枋山鄉', '941', '2023-03-22 15:10:09'),
(305, 16, '屏東縣', '春日鄉', '942', '2023-03-22 15:10:09'),
(306, 16, '屏東縣', '獅子鄉', '943', '2023-03-22 15:10:09'),
(307, 16, '屏東縣', '車城鄉', '944', '2023-03-22 15:10:09'),
(308, 16, '屏東縣', '牡丹鄉', '945', '2023-03-22 15:10:09'),
(309, 16, '屏東縣', '恆春鎮', '946', '2023-03-22 15:10:09'),
(310, 16, '屏東縣', '滿洲鄉', '947', '2023-03-22 15:10:09'),
(311, 17, '台東縣', '台東市', '950', '2023-03-22 15:10:09'),
(312, 17, '台東縣', '綠島鄉', '951', '2023-03-22 15:10:09'),
(313, 17, '台東縣', '蘭嶼鄉', '952', '2023-03-22 15:10:09'),
(314, 17, '台東縣', '延平鄉', '953', '2023-03-22 15:10:09'),
(315, 17, '台東縣', '卑南鄉', '954', '2023-03-22 15:10:09'),
(316, 17, '台東縣', '鹿野鄉', '955', '2023-03-22 15:10:09'),
(317, 17, '台東縣', '關山鎮', '956', '2023-03-22 15:10:09'),
(318, 17, '台東縣', '海端鄉', '957', '2023-03-22 15:10:09'),
(319, 17, '台東縣', '池上鄉', '958', '2023-03-22 15:10:09'),
(320, 17, '台東縣', '東河鄉', '959', '2023-03-22 15:10:09'),
(321, 17, '台東縣', '成功鎮', '961', '2023-03-22 15:10:09'),
(322, 17, '台東縣', '長濱鄉', '962', '2023-03-22 15:10:09'),
(323, 17, '台東縣', '太麻里', '963', '2023-03-22 15:10:09'),
(324, 17, '台東縣', '金峰鄉', '964', '2023-03-22 15:10:09'),
(325, 17, '台東縣', '大武鄉', '965', '2023-03-22 15:10:09'),
(326, 17, '台東縣', '達仁鄉', '966', '2023-03-22 15:10:09'),
(327, 18, '花蓮縣', '花蓮市', '970', '2023-03-22 15:10:09'),
(328, 18, '花蓮縣', '新城鄉', '971', '2023-03-22 15:10:09'),
(329, 18, '花蓮縣', '秀林鄉', '972', '2023-03-22 15:10:09'),
(330, 18, '花蓮縣', '吉安鄉', '973', '2023-03-22 15:10:09'),
(331, 18, '花蓮縣', '壽豐鄉', '974', '2023-03-22 15:10:09'),
(332, 18, '花蓮縣', '鳳林鎮', '975', '2023-03-22 15:10:09'),
(333, 18, '花蓮縣', '光復鄉', '976', '2023-03-22 15:10:10'),
(334, 18, '花蓮縣', '豐濱鄉', '977', '2023-03-22 15:10:10'),
(335, 18, '花蓮縣', '瑞穗鄉', '978', '2023-03-22 15:10:10'),
(336, 18, '花蓮縣', '萬榮鄉', '979', '2023-03-22 15:10:10'),
(337, 18, '花蓮縣', '玉里鎮', '981', '2023-03-22 15:10:10'),
(338, 18, '花蓮縣', '卓溪鄉', '982', '2023-03-22 15:10:10'),
(339, 18, '花蓮縣', '富里鄉', '983', '2023-03-22 15:10:10'),
(340, 19, '宜蘭縣', '宜蘭巿', '260', '2023-03-22 15:10:10'),
(341, 19, '宜蘭縣', '頭城鎮', '261', '2023-03-22 15:10:10'),
(342, 19, '宜蘭縣', '礁溪鄉', '262', '2023-03-22 15:10:10'),
(343, 19, '宜蘭縣', '壯圍鄉', '263', '2023-03-22 15:10:10'),
(344, 19, '宜蘭縣', '員山鄉', '264', '2023-03-22 15:10:10'),
(345, 19, '宜蘭縣', '羅東鎮', '265', '2023-03-22 15:10:10'),
(346, 19, '宜蘭縣', '三星鄉', '266', '2023-03-22 15:10:10'),
(347, 19, '宜蘭縣', '大同鄉', '267', '2023-03-22 15:10:10'),
(348, 19, '宜蘭縣', '五結鄉', '268', '2023-03-22 15:10:10'),
(349, 19, '宜蘭縣', '冬山鄉', '269', '2023-03-22 15:10:10'),
(350, 19, '宜蘭縣', '蘇澳鎮', '270', '2023-03-22 15:10:10'),
(351, 19, '宜蘭縣', '南澳鄉', '272', '2023-03-22 15:10:10'),
(352, 19, '宜蘭縣', '釣魚台', '290', '2023-03-22 15:10:10'),
(353, 20, '澎湖縣', '馬公市', '880', '2023-03-22 15:10:10'),
(354, 20, '澎湖縣', '西嶼鄉', '881', '2023-03-22 15:10:10'),
(355, 20, '澎湖縣', '望安鄉', '882', '2023-03-22 15:10:10'),
(356, 20, '澎湖縣', '七美鄉', '883', '2023-03-22 15:10:10'),
(357, 20, '澎湖縣', '白沙鄉', '884', '2023-03-22 15:10:10'),
(358, 20, '澎湖縣', '湖西鄉', '885', '2023-03-22 15:10:10'),
(359, 21, '金門縣', '金沙鎮', '890', '2023-03-22 15:10:10'),
(360, 21, '金門縣', '金湖鎮', '891', '2023-03-22 15:10:10'),
(361, 21, '金門縣', '金寧鄉', '892', '2023-03-22 15:10:10'),
(362, 21, '金門縣', '金城鎮', '893', '2023-03-22 15:10:10'),
(363, 21, '金門縣', '烈嶼鄉', '894', '2023-03-22 15:10:10'),
(364, 21, '金門縣', '烏坵', '896', '2023-03-22 15:10:10'),
(365, 22, '連江縣', '南竿', '209', '2023-03-22 15:10:10'),
(366, 22, '連江縣', '北竿', '210', '2023-03-22 15:10:10'),
(367, 22, '連江縣', '莒光', '211', '2023-03-22 15:10:10'),
(368, 22, '連江縣', '東引', '212', '2023-03-22 15:10:10'),
(369, 5, '新竹市', '北區', '300', '2023-08-20 18:27:04'),
(370, 5, '新竹市', '東區', '300', '2023-08-20 18:27:04'),
(371, 5, '新竹市', '香山區', '300', '2023-08-20 18:27:11'),
(372, 12, '嘉義市', '東區', '600', '2023-08-20 18:28:02'),
(373, 12, '嘉義市', '西區', '600', '2023-08-20 18:28:02');

-- --------------------------------------------------------

--
-- 資料表結構 `faqs`
--

CREATE TABLE `faqs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `question` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '問題',
  `answer` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '回答',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `faqs`
--

INSERT INTO `faqs` (`id`, `sort`, `question`, `answer`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 0, '<p>這是一翻賞嗎??</p>', '<p>沒錯!</p>', 'on', '2024-07-22 06:53:03', '2024-07-22 11:25:15', NULL),
(2, 0, '沒有收到商品。', '請聯絡官方客服!', 'on', '2024-07-22 06:53:03', '2024-07-22 08:53:51', NULL),
(3, 0, '<p>問題測試~</p>', '<p>回復測試~</p>', 'on', '2024-07-22 09:30:06', '2024-07-22 09:30:06', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `media`
--

CREATE TABLE `media` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `media_type` enum('img','file') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'img' COMMENT '媒體類型',
  `position` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '使用在哪',
  `relation_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '對應主ID',
  `path` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '主要路徑;配合Storage',
  `realname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '上傳時的檔名',
  `showname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '下載時要顯示的名稱',
  `remark` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '備註',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `media`
--

INSERT INTO `media` (`id`, `code`, `media_type`, `position`, `relation_id`, `path`, `realname`, `showname`, `remark`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, '8f3d211c-139b-4327-ab02-7a263b11560c', 'img', '', 0, '668bc4ac4864c.jpeg', '', '', '', '2024-07-08 10:51:24', '2024-07-08 10:51:24', NULL),
(2, '9decbee0-5129-4903-8cf8-4c8487fc1e57', 'img', '', 0, '668cb42fda227.jpeg', '', '', '', '2024-07-09 03:53:19', '2024-07-09 03:53:19', NULL),
(3, '5aee2c4d-0a16-4201-b9a0-ae4e7afb8269', 'img', '', 0, '668cb526b1158.jpeg', '', '', '', '2024-07-09 03:57:26', '2024-07-09 03:57:26', NULL),
(4, 'f9446a38-39f1-4585-bb57-58670539cbc0', 'img', '', 0, '668cb5734002e.jpeg', '', '', '', '2024-07-09 03:58:43', '2024-07-09 03:58:43', NULL),
(5, '7551ec04-9e27-4a30-8f69-abbbf75a5a2d', 'img', '', 0, '66988c02cca20.jpeg', '', '', '', '2024-07-18 03:29:07', '2024-07-18 03:29:07', NULL),
(6, 'cb4c884e-8b77-4ff9-b0b7-54fce7e5bcde', 'img', '', 0, '669a32ce59898.jpeg', '', '', '', '2024-07-19 09:33:02', '2024-07-19 09:33:02', NULL),
(7, 'b7f49191-b224-4f14-92b5-e7904ee009e7', 'img', '', 0, '669a32e47bbc3.jpeg', '', '', '', '2024-07-19 09:33:24', '2024-07-19 09:33:24', NULL),
(8, 'e77bf3a6-a1eb-4d98-8395-e958568e42ff', 'img', '', 0, '669a358c5f90f.jpeg', '', '', '', '2024-07-19 09:44:44', '2024-07-19 09:44:44', NULL),
(9, '3a4c3e89-06be-4d82-bf3d-9102786934a8', 'img', '', 0, '669a375cd91fe.jpeg', '', '', '', '2024-07-19 09:52:28', '2024-07-19 09:52:28', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `members`
--

CREATE TABLE `members` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `role` enum('super','college','assistant','professor') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'super' COMMENT '身分別',
  `username` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `ID_number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `line_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'LINEID',
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `avatar` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `privilege_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '權限ID',
  `department_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '部門ID',
  `is_mail` bigint(20) NOT NULL DEFAULT 1 COMMENT '是否收到mail',
  `is_line` bigint(20) NOT NULL DEFAULT 1 COMMENT '是否收到Line通知',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL,
  `create_by` bigint(20) NOT NULL DEFAULT 0 COMMENT '建立者ID',
  `update_by` bigint(20) NOT NULL DEFAULT 0 COMMENT '異動者ID',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `members`
--

INSERT INTO `members` (`id`, `role`, `username`, `ID_number`, `line_id`, `email`, `avatar`, `password`, `privilege_id`, `department_id`, `is_mail`, `is_line`, `status`, `create_by`, `update_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'super', 'admin', 'admin', '', '', 'avatar.svg', '1f3202d820180a39f736f20fce790de8', '1', 0, 1, 1, 'on', 0, 0, '2024-07-01 03:56:26', '2024-07-22 09:07:50', NULL),
(2, 'super', 'admin_2', 'admin_2', '', '', 'avatar.svg', '1f3202d820180a39f736f20fce790de8', '1', 0, 1, 1, 'on', 0, 0, '2024-07-01 03:56:26', '2024-07-22 11:25:58', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2024_07_01_111628_create_members_table', 1),
(2, '2024_07_01_121949_create_privileges_table', 2),
(3, '2024_07_01_122051_create_privilege_menus_table', 2),
(4, '2024_07_01_122114_create_privilege_menu_related_table', 2),
(5, '2024_07_01_140831_create_users_table', 3),
(6, '2024_07_01_151834_add_birthday_to_users_table', 4),
(7, '2024_07_01_154326_create_user_phone_verifieds_table', 5),
(8, '2024_07_01_154751_create_user_phone_verifieds_table', 6),
(9, '2024_07_02_163354_create_products_table', 7),
(10, '2024_07_02_172633_create_products_awards_table', 8),
(11, '2024_07_03_121346_create_product_awards_table', 9),
(12, '2024_07_04_141534_create_user_email_verifieds_table', 10),
(13, '2024_07_04_152542_create_user_recipients_table', 11),
(14, '2024_07_08_135303_create_tags_table', 12),
(15, '2024_07_08_140805_create_tags_table', 13),
(16, '2024_07_08_184906_create_media_table', 14),
(17, '2024_07_18_142220_create_point_logs_table', 15),
(18, '2024_07_19_154631_create_news_table', 16),
(19, '2024_07_19_183922_create_faqs_table', 17),
(20, '2024_07_22_180900_create_cooperative_stores_table', 18);

-- --------------------------------------------------------

--
-- 資料表結構 `news`
--

CREATE TABLE `news` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `lang` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'tw' COMMENT '語系(預設中文)',
  `cover` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '大圖',
  `thumb` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '小圖',
  `category` enum('bulletin','media','discount') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'bulletin' COMMENT '分類',
  `date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '公開顯示日期',
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '標題',
  `summary` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '摘要',
  `content` longtext COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '內文',
  `online_date` datetime NOT NULL DEFAULT current_timestamp() COMMENT '上線日',
  `offline_date` datetime NOT NULL DEFAULT current_timestamp() COMMENT '下線日',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on',
  `create_by` bigint(20) NOT NULL DEFAULT 1 COMMENT '建立者',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `news`
--

INSERT INTO `news` (`id`, `lang`, `cover`, `thumb`, `category`, `date`, `title`, `summary`, `content`, `online_date`, `offline_date`, `status`, `create_by`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'tw', 'test', 'test', 'bulletin', 'test', 'test123', 'test', '<p>test</p>', '2024-07-19 16:51:14', '2024-07-19 16:51:14', 'on', 1, '2024-07-19 08:50:08', '2024-07-19 09:30:27', NULL),
(2, 'tw', '', '', 'bulletin', '', '123', '123', '<p>213</p>', '2024-07-19 17:44:01', '2024-07-19 17:44:01', 'on', 1, '2024-07-19 09:44:01', '2024-07-19 09:44:01', NULL),
(3, 'tw', '669a358c5f90f.jpeg', '', 'bulletin', '', '888', '88', '<p>8</p>', '2024-07-19 17:44:50', '2024-07-19 17:44:50', 'on', 1, '2024-07-19 09:44:50', '2024-07-19 09:44:50', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `point_logs`
--

CREATE TABLE `point_logs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `operator` bigint(20) NOT NULL DEFAULT 0 COMMENT '操作人',
  `user_id` bigint(20) NOT NULL DEFAULT 0 COMMENT 'USER',
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `action` enum('plus','minus') COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '動作',
  `amount` bigint(20) NOT NULL DEFAULT 0 COMMENT '數量',
  `result` bigint(20) NOT NULL DEFAULT 0 COMMENT '操作後總數',
  `remaining` bigint(20) NOT NULL DEFAULT 0 COMMENT '若為plus,此筆紀錄剩餘多少	',
  `deadline` date NOT NULL COMMENT '到期日',
  `msg` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '備註訊息',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `point_logs`
--

INSERT INTO `point_logs` (`id`, `operator`, `user_id`, `mobile`, `action`, `amount`, `result`, `remaining`, `deadline`, `msg`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 0, 1, '0929288035', 'plus', 10, 10, 10, '2024-07-18', '測試', '2024-07-18 06:42:16', NULL, NULL),
(2, 0, 1, '0929288035', 'plus', 20, 30, 20, '2024-07-18', '測試', '2024-07-18 06:42:16', NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `privileges`
--

CREATE TABLE `privileges` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '權限群組名稱',
  `op_user` enum('all','specific') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'all' COMMENT '使用者操作權限',
  `op_product` enum('all','specific') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'all' COMMENT '產品操作權限',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `privileges`
--

INSERT INTO `privileges` (`id`, `title`, `op_user`, `op_product`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, '最高權限', 'all', 'all', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `privileges_action`
--

CREATE TABLE `privileges_action` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '權限類別',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `privileges_action`
--

INSERT INTO `privileges_action` (`id`, `title`, `created_at`, `updated_at`) VALUES
(1, '瀏覽', '2024-07-01 04:22:03', NULL),
(2, '新增', '2024-07-01 04:22:03', NULL),
(3, '編輯', '2024-07-01 04:22:03', NULL),
(4, '刪除', '2024-07-01 04:22:03', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `privilege_menus`
--

CREATE TABLE `privilege_menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `parent_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '父層ID;0為父層',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '選單名稱',
  `icon` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'icon',
  `url` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'route url',
  `function` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'function,active用',
  `action` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1,2,3,4' COMMENT '可做動作',
  `badge` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'Badge',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '狀態',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `privilege_menu_related`
--

CREATE TABLE `privilege_menu_related` (
  `privilege_id` bigint(20) NOT NULL COMMENT 'Privilege ID',
  `menu_id` bigint(20) NOT NULL COMMENT 'Menu ID',
  `action_id` bigint(20) NOT NULL COMMENT 'Action ID',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `category_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0' COMMENT '主分類',
  `classify_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0' COMMENT '子分類',
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `no` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '產品編號',
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '產品名稱',
  `cover` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '主圖',
  `summary` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '摘要',
  `des` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '內文',
  `stock` bigint(20) NOT NULL DEFAULT 0 COMMENT '庫存',
  `total_quantity` bigint(20) NOT NULL DEFAULT 0 COMMENT '總數量',
  `price` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '價格',
  `tags` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '標籤',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '是否開啟',
  `is_hot` bigint(20) NOT NULL DEFAULT 0 COMMENT '熱門產品',
  `percentage` bigint(20) NOT NULL DEFAULT 0 COMMENT '大賞機率',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`id`, `category_id`, `classify_id`, `sort`, `no`, `name`, `cover`, `summary`, `des`, `stock`, `total_quantity`, `price`, `tags`, `status`, `is_hot`, `percentage`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, '0', '0', 0, '1234', '日版 一番賞 航海王', '668cb5734002e.jpeg', '航海王..........', '<p>航海王..........</p>', 30, 60, '320', '1,2,3', 'on', 0, 20, '2024-07-02 10:43:58', '2024-07-18 04:21:07', NULL),
(2, '0', '0', 0, '56678', '獵人', '669a375cd91fe.jpeg', '城市獵人', '<p>還是美食獵人</p>', 1, 1, '', '2', 'on', 0, 0, '2024-07-19 09:52:35', '2024-07-19 09:53:45', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `products_awards`
--

CREATE TABLE `products_awards` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '對應產品ID',
  `level` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '獎賞等級',
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `awards_no` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品編號',
  `awards_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品名稱',
  `awards_cover` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品主圖',
  `awards_summary` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品摘要',
  `awards_des` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品內文',
  `awards_stock` bigint(20) NOT NULL DEFAULT 0 COMMENT '獎品庫存',
  `awards_total_quantity` bigint(20) NOT NULL DEFAULT 0 COMMENT '獎品總數量',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '是否開啟',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products_awards`
--

INSERT INTO `products_awards` (`id`, `product_id`, `level`, `sort`, `awards_no`, `awards_name`, `awards_cover`, `awards_summary`, `awards_des`, `awards_stock`, `awards_total_quantity`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 1, 'A', 0, '13', '太陽神魯夫', '123', '人人果實..........', '人人果實..........', 1, 1, 'on', '2024-07-03 03:53:15', NULL, NULL),
(2, 1, 'B', 0, '15', '四檔魯夫', '123', '彈跳人..........', '彈跳人..........', 2, 2, 'on', '2024-07-03 03:53:15', NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `product_awards`
--

CREATE TABLE `product_awards` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) NOT NULL DEFAULT 0 COMMENT '對應產品ID',
  `level` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎賞等級',
  `sort` bigint(20) NOT NULL DEFAULT 0 COMMENT '排序',
  `awards_no` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品編號',
  `awards_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品名稱',
  `awards_cover` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品主圖',
  `awards_summary` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品摘要',
  `awards_des` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '獎品內文',
  `awards_stock` bigint(20) NOT NULL DEFAULT 0 COMMENT '獎品庫存',
  `awards_total_quantity` bigint(20) NOT NULL DEFAULT 0 COMMENT '獎品總數量',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '是否開啟',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `product_awards`
--

INSERT INTO `product_awards` (`id`, `product_id`, `level`, `sort`, `awards_no`, `awards_name`, `awards_cover`, `awards_summary`, `awards_des`, `awards_stock`, `awards_total_quantity`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 1, 'A', 0, 'SS13', '太陽神魯夫', '123', '人人果實..........', '人人果實..........', 1, 1, 'on', '2024-07-03 03:53:15', NULL, NULL),
(2, 1, 'B', 0, 'SS15', '四檔魯夫', '123', '彈跳人..........', '彈跳人..........', 2, 2, 'on', '2024-07-03 03:53:15', NULL, NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `tags`
--

CREATE TABLE `tags` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '名稱',
  `status` enum('on','off') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'on' COMMENT '是否開啟',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `tags`
--

INSERT INTO `tags` (`id`, `title`, `status`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, '特賞', 'on', '2024-07-08 06:08:49', NULL, NULL),
(2, '稀有', 'on', '2024-07-08 06:09:46', NULL, NULL),
(3, '新品~', 'on', '2024-07-08 09:52:58', '2024-07-08 09:53:16', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `role` enum('tourist','islander','senior_islander') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'tourist' COMMENT '身分角色(依序遊客、島民、資深島民)',
  `username` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '暱稱',
  `realname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '真實姓名',
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '聯繫人電話',
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'Email',
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `gender` enum('normal','male','female') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'normal' COMMENT '性別',
  `status` enum('normal','not_verify','verified','inreview','block') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'not_verify',
  `point` bigint(20) NOT NULL COMMENT '點數',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `birthday` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '生日'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`id`, `role`, `username`, `realname`, `phone`, `email`, `password`, `gender`, `status`, `point`, `created_at`, `updated_at`, `deleted_at`, `birthday`) VALUES
(1, 'islander', '修', '阿修', '0929288035', 'sss9611300@yahoo.com.tw', '1f3202d820180a39f736f20fce790de8', 'male', 'not_verify', 30, '2024-07-01 07:04:56', '2024-07-04 06:23:30', NULL, '1999-11-11'),
(2, 'senior_islander', '阿志', '許文志', '0929288035', 'sss9611300@yahoo.com.tw', '1f3202d820180a39f736f20fce790de8', 'male', 'not_verify', 0, '2024-07-04 04:16:33', '2024-07-05 10:35:42', NULL, '2024-07-03');

-- --------------------------------------------------------

--
-- 資料表結構 `user_email_verifieds`
--

CREATE TABLE `user_email_verifieds` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) NOT NULL DEFAULT 0 COMMENT 'user ID',
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT 'Email',
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '驗證碼',
  `status` enum('pending','success') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `user_phone_verifieds`
--

CREATE TABLE `user_phone_verifieds` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) NOT NULL DEFAULT 0 COMMENT 'user ID',
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '手機',
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '驗證碼',
  `status` enum('pending','success') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `user_recipients`
--

CREATE TABLE `user_recipients` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) NOT NULL DEFAULT 0 COMMENT 'user ID',
  `username` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '收貨人姓名',
  `city` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '城市',
  `dist` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '行政區',
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '收貨地址',
  `phone` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '收貨人聯絡電話',
  `ext` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '電話分機',
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '收貨人Email',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `user_recipients`
--

INSERT INTO `user_recipients` (`id`, `user_id`, `username`, `city`, `dist`, `address`, `phone`, `ext`, `email`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 1, '韓修文', '1', '3', '新樹路100號', '0929288035', '', 'SSS@gmail.com', '2024-07-05 03:09:16', '2024-07-05 10:07:11', NULL),
(2, 1, '韓修龍', '2', '16', '新樹路100號', '0929288035', '', 'SSS@gmail.com', '2024-07-05 03:09:16', '2024-07-05 10:13:17', NULL),
(3, 1, '王大文', '1', '1', 'gsfsdf', '0929292929', '', '', '2024-07-05 10:22:34', '2024-07-05 10:22:34', NULL),
(4, 1, 'ROCK', '1', '1', 'gsfsdf21', '2131231312', '', '', '2024-07-05 10:24:31', '2024-07-05 10:24:31', NULL),
(5, 2, '韓國人', '10', '156', '集集鹿100號', '0912345678', '', '', '2024-07-05 10:35:14', '2024-07-05 10:35:14', NULL);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `cooperative_stores`
--
ALTER TABLE `cooperative_stores`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `dists`
--
ALTER TABLE `dists`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `faqs`
--
ALTER TABLE `faqs`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `media`
--
ALTER TABLE `media`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `point_logs`
--
ALTER TABLE `point_logs`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `privileges`
--
ALTER TABLE `privileges`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `privileges_action`
--
ALTER TABLE `privileges_action`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `privilege_menus`
--
ALTER TABLE `privilege_menus`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `privilege_menu_related`
--
ALTER TABLE `privilege_menu_related`
  ADD PRIMARY KEY (`privilege_id`,`menu_id`,`action_id`);

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `products_awards`
--
ALTER TABLE `products_awards`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `product_awards`
--
ALTER TABLE `product_awards`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `tags`
--
ALTER TABLE `tags`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_email_verifieds`
--
ALTER TABLE `user_email_verifieds`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_phone_verifieds`
--
ALTER TABLE `user_phone_verifieds`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_recipients`
--
ALTER TABLE `user_recipients`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `cooperative_stores`
--
ALTER TABLE `cooperative_stores`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `dists`
--
ALTER TABLE `dists`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=374;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `faqs`
--
ALTER TABLE `faqs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `media`
--
ALTER TABLE `media`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `members`
--
ALTER TABLE `members`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `news`
--
ALTER TABLE `news`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `point_logs`
--
ALTER TABLE `point_logs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `privileges`
--
ALTER TABLE `privileges`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `privileges_action`
--
ALTER TABLE `privileges_action`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `privilege_menus`
--
ALTER TABLE `privilege_menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products_awards`
--
ALTER TABLE `products_awards`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_awards`
--
ALTER TABLE `product_awards`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `tags`
--
ALTER TABLE `tags`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_email_verifieds`
--
ALTER TABLE `user_email_verifieds`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_phone_verifieds`
--
ALTER TABLE `user_phone_verifieds`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_recipients`
--
ALTER TABLE `user_recipients`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
